app/Models/ModelDataSiswa.php

SELECT *
FROM `tbl_siswa`
ORDER BY `siswa_nis` DESC
---
    public function allData()
    {
        return $this->db->table('tbl_siswa')
        ->orderBy('siswa_nis', 'DESC')
        ->get()->getResultArray();